Revit 2015 API
AnalyticalModelSweptProfile Properties
The AnalyticalModelSweptProfile type exposes the following members.
Properties
Name | Description
EndSetBack
 The distance from the end of the driving curve to the point where the sweep actually ends.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StartSetBack
 The distance from the start of the driving curve to the point where the sweep actually begins.
See Also
AnalyticalModelSweptProfile Class
Autodesk.Revit.DB.Structure Namespace